Revit 2027 API
CircleLightShape(Double) Constructor
 Creates a circle light shape object with the given emit diameter.
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public CircleLightShape(
	double emitDiameter
)
Public Sub New (
	emitDiameter As Double
)
public:
CircleLightShape(
	double emitDiameter
)
new :
        emitDiameter : float -> CircleLightShape
Parameters
emitDiameter Double
 The emit diameter as a numerical value in feet between 1.0e-9 and 30000.0
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The shape dimension is not valid because it is not between 1.0e-9 and 30000.0.
See Also
Reference
CircleLightShape Class
CircleLightShape Overload
Autodesk.Revit.DB.Lighting Namespace